Week 0/README.org
* Week 0: Pre-Winter Quarter 2016 Notes
** Stable matching problem
Kleinberg and Tardos begin their book by introducing us to the
/stable matching problem/. This problem is best summarized by the 
situations it may be used in: a college is trying to choose the best
students from its candidate pool, while maintaining stability. As
Kleinberg and Tardos introduce it, they want a self-enforcing
system.
