Week 0/README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Week 0: Pre-Winter Quarter 2016 Notes</a>
<ul>
<li><a href="#sec-1-1">1.1. Stable matching problem</a></li>
</ul>
</li>
</ul>
</div>
</div>

# Week 0: Pre-Winter Quarter 2016 Notes<a id="sec-1" name="sec-1"></a>

## Stable matching problem<a id="sec-1-1" name="sec-1-1"></a>

Kleinberg and Tardos begin their book by introducing us to the
*stable matching problem*. This problem is best summarized by the 
situations it may be used in: a college is trying to choose the best
students from its candidate pool, while maintaining stability. As
Kleinberg and Tardos introduce it, they want a self-enforcing
system.